cases/Biofilm_growth/3D/heterogeneity/0/CbyC0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{

    left
    {
         type            fixedValue;
       value	       uniform 1;
    }

    right
    {
 type            fixedValue;
       value	       uniform 0;        
//type           zeroGradient;
 // value	       uniform 0;
    }

    bottom
    {
 // type           zeroGradient;
type            fixedValue;
     value	       uniform 0;
    }

    top
    {
 // type           zeroGradient;
     type            fixedValue;
  value	       uniform 0;
    }

   front
    {
        type             zeroGradient;
    }
    back
    {
        type             zeroGradient;
    }
}

// ************************************************************************* //
