cases/Biofilm_growth/3D/heterogeneity/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{

   

    left
    {
          type            fixedValue;
       value	       uniform 0;
    }

    right
    {
          type            fixedValue;
       value	       uniform 0;
    }

    bottom
    {
       
type            fixedValue;
       value	       uniform 0; //type            zeroGradient;
    }

    top
    {
      
type            fixedValue;
       value	       uniform 0; // type            zeroGradient;
    }

    front
    {
        type             zeroGradient;
    }
    back
    {
        type             zeroGradient;
    }
}

// ************************************************************************* //
