cases/Biofilm_growth/3D/heterogeneity/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    front
    {
        type            patch;
        nFaces          4096;
        startFace       774144;
    }
    back
    {
        type            patch;
        nFaces          4096;
        startFace       778240;
    }
    top
    {
        type            patch;
        nFaces          4096;
        startFace       782336;
    }
    bottom
    {
        type            patch;
        nFaces          4096;
        startFace       786432;
    }
    left
    {
        type            patch;
        nFaces          4096;
        startFace       790528;
    }
    right
    {
        type            patch;
        nFaces          4096;
        startFace       794624;
    }
)

// ************************************************************************* //
